src/InformationRegisters/Scan_НастройкиКлючевыхДатПоПользователям/Scan_НастройкиКлючевыхДатПоПользователям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_НастройкиКлючевыхДатПоПользователям</name>
  <resources>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>КлючеваяДата</name>
    <type>
      <types>EnumRef.Scan_КлючевыеДаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_НастройкиКлючевыхДатПоПользователям/ManagerModule.bsl
//rarus BProg_Dekin 31.10.2019 0014452 +-
#Область Интерфейс

// Функция записи параметров в регистр сведений
// Параметры:
//  ВидКлючевойДаты - ПеречислениеСсылка.Scan_КлючевыеДаты – вид ключевой даты
//	ЗначенияРесурсов - Строка табличной части, структура и т.д - Коллекция, к значениям которой можно обратиться через точку
// Возвращаемое значение:
//   Булево   – ошибка записи значения
Функция ЗаписьЗначенияРегистраСведения(ВидКлючевойДаты, Пользователь, Использование) Экспорт 
	
	Отказ = Ложь;
	Если НЕ ЗначениеЗаполнено(ВидКлючевойДаты) ИЛИ НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Отказ = Истина;
		Возврат Отказ;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.Scan_НастройкиКлючевыхДатПоПользователям.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.КлючеваяДата	 = ВидКлючевойДаты;
	МенеджерЗаписи.Пользователь	 = Пользователь;
	Если Использование <> Неопределено тогда
		МенеджерЗаписи.Использование = Использование;
	КонецЕсли;
	
	Попытка
		Если Использование = Неопределено тогда
			МенеджерЗаписи.Удалить();  
		Иначе
			МенеджерЗаписи.Записать();  
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки; 
		
	Возврат Отказ;
КонецФункции

// Функция - Получить настройки
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи	 - 
// 
// Возвращаемое значение:
// ТаблицаЗначений  - Строки таблицы содержат настройки для ключевой даты.
//
Функция ПолучитьНастройки(ОбъектКлючевыхДат , Пользователь = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", 		?(Пользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, Пользователь));
	Запрос.УстановитьПараметр("ЗначениеПоУмолчанию",ЗначениеНастройкиПоУмолчанию());
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КлючевыеДаты.Ссылка КАК КлючеваяДата,
	               |	ЕСТЬNULL(Scan_НастройкиКлючевыхДатПоПользователям.Использование, &ЗначениеПоУмолчанию) КАК Использование
	               |ИЗ
	               |	Перечисление.Scan_КлючевыеДаты КАК Scan_КлючевыеДаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Scan_НастройкиКлючевыхДатПоПользователям КАК Scan_НастройкиКлючевыхДатПоПользователям
	               |		ПО Scan_КлючевыеДаты.Ссылка = Scan_НастройкиКлючевыхДатПоПользователям.КлючеваяДата
	               |			И (Scan_НастройкиКлючевыхДатПоПользователям.Пользователь = &Пользователь)";
	Настройки = Запрос.Выполнить().Выгрузить();
	Возврат Настройки;
КонецФункции

#КонецОбласти 

#Область Служебные

Функция ЗначениеНастройкиПоУмолчанию()
	Возврат Неопределено;
КонецФункции

#КонецОбласти
